tsung/flow1234.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Item Index" probability="35" type="ts_http">
      <!-- Set dynamic variable for use in item viewing request -->
      <setdynvars sourcetype="random_number" start="1" end="1000">
        <var name="rndint" />
      </setdynvars>

      <!-- Visit homepage -->
      <request><http url='/' version='1.1' method='GET'/></request>

      <!-- Visit items page -->
      <request><http url='/items' version='1.1' method='GET'/></request>

      <!-- Wait to simulate user looking around -->
      <thinktime value="1" random="false"/>

      <!-- Select random item from item page (we know we generate ~8000 items) -->
      <request subst="true">
        <dyn_variable name="rndint"/>
        <http url="/items/%%_rndint%%"/>
      </request>
    </session>

    <session name="Item Creation" probability="15" type="ts_http">

      <setdynvars sourcetype="random_number" start="2" end="100">
        <var name="random_user_number" />
      </setdynvars>

      <transaction name="SIGN_IN">
        <!-- Visit homepage -->
        <request>
          <http url='/' version='1.1' method='GET'></http>
        </request>

        <request subst="true">
          <http url='/login' version='1.1' method='POST'
              contents="session[email]=user%%_random_user_number%%@example.com&amp;
                          session[password]=foobar&amp;"
              content_type="application/x-www-form-urlencoded"
          />
        </request>
      </transaction>

      <transaction name="CREATE_ITEM">
        <request>
          <http url='/items' version='1.1' method='POST'
              contents="item[title]=Tsung-item&amp;
                        item[description]=description&amp;
                        item[category_id]=1&amp;
                        item[price_hourly_usd]=5&amp;
                        condition=Good&amp;
                        commit=Create Item"
              content_type="application/x-www-form-urlencoded"
          />
        </request>
      </transaction>

      <transaction name="SIGN_OUT">
        <request>
          <http url='/logout' version='1.1' method='DELETE'></http>
        </request>
      </transaction>
    </session>

    <session name="Item Rental" probability="15" type="ts_http">

      <!-- Pick random user  -->
      <setdynvars sourcetype="random_number" start="2" end="100">
        <var name="random_user_number" />
      </setdynvars>

      <!-- landing page -->
      <transaction name="SIGN_IN">
        <request>
          <http url='/' version='1.1' method='GET' />
        </request>

        <!-- login page -->
        <request>
          <http url='/login' version='1.1' method='GET' />
        </request>

        <!-- login post request -->
        <request subst="true">
          <http url='/login' version='1.1' method='POST'
                contents="session[email]=user%%_random_user_number%%@example.com&amp;
                          session[password]=foobar&amp;"
                content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>

      <transaction name="BROWSE_ITEMS">
        <request><http url="/items" method="GET" version="1.1" /></request>
        <request>
          <http url="/items"
                method="GET"
                version="1.1"
                contents="category_search=1"
          />
        </request>
      </transaction>

      <setdynvars sourcetype="random_number" start="1" end="8000">
        <var name="item_id" />
      </setdynvars>

      <transaction name="RENT_ITEM">
        <request subst="true">
          <http url="/items/%%_item_id%%"
                method="GET"
                version="1.1"
          />
        </request>
        <request subst="true">
          <http
                  url="/rent"
                  method="POST"
                  version="1.1"
                  contents="item_id=%%_item_id%%"
                  content_type="application/x-www-form-urlencoded"
          />
        </request>

        <!-- follow redirect -->
        <request subst="true">
          <http url="/items/%%_item_id%%"
                method="GET"
                version="1.1"
          />
        </request>
      </transaction>

    </session>

    <session name="User Browsing" probability="35" type="ts_http">
      
      <!-- Pick random user -->
      <!-- WARNING: assumes you've seeded the db with at least 1000 users named user2, user3, ... -->
      <setdynvars sourcetype="random_number" start="2" end="1000">
        <var name="random_user_number" />
      </setdynvars>
      <!-- Pick random category -->
      <!-- WARNING: assumes you've seeded the db with atleast 10 categories named Category 1 ... Category 10 -->
      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_category_number" />
      </setdynvars>
      <!-- Pick random keyword -->
      <!-- WARNING: assumes you've seeded the db with atleast 10 categories named Category 1 ... Category 10 -->
      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="random_keyword_number" />
      </setdynvars>
      <!-- Pick random item -->
      <setdynvars sourcetype="random_number" start="10" end="7000">
        <var name="first_item" />
      </setdynvars>
      
      <transaction name="SIGN_IN">
        <!-- Visit homepage -->
        <request><http url='/' version='1.1' method='GET'/></request>

        <!-- User log in -->
        <request subst="true">
          <http 
	         url="/login" 
	         method="POST" 
	         version="1.1" 
	         contents="session[email]=user%%_random_user_number%%@example.com&amp;session[password]=foobar&amp;commit=Login" 
	         content_type="application/x-www-form-urlencoded" 
	       />
        </request>
      </transaction>

      <transaction name="SEARCH_CATEGORY">
        <!-- Go to item index page -->
        <request><http url='/items' version='1.1' method='GET'/></request>

        <!-- Search by category -->
        <request subst="true">
          <http
            url="/items"
            method="GET"
            version="1.1"
            contents="category_search=%%_random_category_number%%"
            content_type="application/x-www-form-urlencoded"
          />
        </request>

        <!-- Wait to simulate user looking around -->
        <thinktime value="1" random="false"/>

        <!-- Favorite Item -->
        <request subst="true">
          <http
            url="/favorite"
            method="POST"
            version="1.1"
            contents="item_id=%%_first_item%%"
            content_type="application/x-www-form-urlencoded"
          />
        </request>
      </transaction>

      <transaction name="SEARCH_KEYWORD">
        <!-- Search by keyword -->
        <request subst="true">
          <http
            url="/items"
            method="GET"
            version="1.1"
            contents="keyword_search=%%_random_keyword_number%%"
            content_type="application/x-www-form-urlencoded"
          />
        </request>

        <!-- Wait to simulate user looking around -->
        <thinktime value="1" random="false"/>

        <!-- Unfavorite Item -->
        <request subst="true">
          <http
                  url="/favorite"
                  method="DELETE"
                  version="1.1"
                  contents="item_id=%%_first_item%%"
                  content_type="application/x-www-form-urlencoded"
          />
        </request>
      </transaction>

      <transaction name="SIGN_OUT">
        <request><http url='/logout' version='1.1' method='DELETE'/></request>
      </transaction>
    </session>
  </sessions>
</tsung>