tsung/flow2.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!--
        <arrivalphase phase="2" duration="10" unit="minute">
          <users arrivalrate="4" unit="second"></users>
        </arrivalphase>

        <arrivalphase phase="3" duration="10" unit="minute">
          <users arrivalrate="32" unit="second"></users>
        </arrivalphase>

        <arrivalphase phase="4" duration="10" unit="minute">
          <users arrivalrate="64" unit="second"></users>
        </arrivalphase>
        -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>



  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <setdynvars sourcetype="random_number" start="2" end="1000">
        <var name="random_user_number" />
      </setdynvars>


        <request>
          <http url='/' version='1.1' method='GET'></http>
        </request>



        <request subst="true">
          <http url='/login' version='1.1' method='POST'
                contents="session[email]=user2@example.com&amp;
                          session[password]=foobar&amp;"
                content_type="application/x-www-form-urlencoded" />
        </request>

        <request>
          <http url='/new' version='1.1' method='POST'
                contents="id=3002&amp;
                        user_id=2&amp;
                        title=b2&amp;
                        description=description&amp;
                        category_id=1&amp;
                        available=true&amp;
                        price_hourly_usd=5&amp;
                        price_daily_usd=5&amp;
                        condition=Good&amp;"
                content_type="application/x-www-form-urlencoded" />
        </request>



    </session>
  </sessions>
</tsung>