tsung/flow2.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="podz-kasper.42dz3asytu.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="10" unit="minute">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="10" unit="minute">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="10" unit="minute">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <for from="1" to="999" incr="1" var="counter">

        <request>
          <http url='/' version='1.1' method='GET'></http>
        </request>
        <request>
          <http url='/login' version='1.1' method='POST'
                contents="session[email]=user%%_counter%%@example.com&amp;
                          session[password]=foobar&amp;"
                content_type="application/x-www-form-urlencoded" />
        </request>
        <request>
          <http url='/new' version='1.1' method='POST'
                contents="session[title]=item_title%%_counter%%&amp;
                          session[description]=description&amp;
                          session[category_id]=1&amp;
                          session[available]=true&amp;
                          session[price_hourly_usd]=5&amp;
                          session[condition]=1&amp;"
                content_type="application/x-www-form-urlencoded" />
        </request>
      </for>
    </session>
  </sessions>
</tsung>